<template>
  <el-dialog
    title="APP注册协议"
     fullscreen
    :close-on-click-modal="false"
    :visible.sync="visible"
    center>
    <div>
        <p style="text-indent:2em;">在拍货郎在线拍卖平台注册的用户（即“竞购人”），在同意本协议以下全部条款后，方有资格享受拍货郎在线拍卖平台（以下简称“平台”）提供的拍卖服务（以下简称“服务”）。您使用本平台提供的服务即意味着同意与本平台签订本协议并同意接受本协议约束，使用服务前请认真阅读本协议。
        </p>
        <h3 style="text-align:center;">第一条：立约背景</h3>
        <p style="text-indent:2em;">为维护拍货郎在线拍卖的活动秩序，规范竞购人参与拍卖活动的行为，保障用户的合法权益，基于相应的拍卖流程与拍卖规则（以下简称：规则）和拍货郎在线拍卖平台公示的规则，特制定本协议。</p>
        <h3 style="text-align:center;">第二条：参与竞拍的条件</h3>
        <p style="text-indent:2em;"> 同时符合以下条件的用户方能参与拍货郎在线拍卖平台提供的拍卖竞购活动：</p>
        <p>
            2.1 用户注册为拍货郎在线拍卖平台会员，拥有独立的拍货郎在线拍卖平台用户名并实名认证；<br />
            2.2 同意本协议及拍卖竞购规则中的条款；<br />
            2.3 按照拍卖竞购规则缴纳相应的参拍保证金；<br />
        </p>
        <h3 style="text-align:center;">第三条：服务说明</h3>
        <p style="text-indent:2em;">本平台开展的拍卖竞购活动要求参与竞拍的用户缴纳相应保证金，以取得拍卖竞购资格。用户通过本平台参与拍卖竞购活动前应仔细阅读拍卖竞购规则，并应予以遵守。</p>
        <h3 style="text-align:center;">第四条：用户权利和义务</h3>
        <p> 4.1 用户应自行妥善保管自己的账户及密码，所有以账户名及密码登入在线拍卖平台的拍卖竞购行为都被认为用户本人参与拍卖竞购活动的行为，用户应自行承担参与拍卖竞购行为产生的相应义务及责任。<br />
            4.2 参与拍卖竞购活动的商品由委托人提供，并由委托人进行商品信息、商品介绍、商品咨询、配送、及相应的售后服务。用户参与拍卖竞购活动前应仔细查看拍卖竞购活动页面对拍卖商品的信息披露、商品描述介绍，且知悉认可因摄影、显示等造成描述的色调等与原物有误差的，以原物为准。<br />
            4.3 用户知悉互联网再线拍卖竞购活动数据处理的时间间隙，如遇系统提示出价金额与最终出价金额不同，用户认可以最终出价金额为准。<br>
            4.4 用户参与拍卖竞购活动成功取得最终购买的竞购商品时，应按拍卖竞购规则完成商品交易。如未按拍卖竞购规则完成交易的，用户应按拍卖竞购规则承担相应责任及不利后果。<br>
            4.5 用户应按照拍卖竞购规则及规定的保证金金额缴纳保证金，在拍卖竞购成功后应在拍卖竞购规则规定的时间内（拍中商品的24小时内）完成付款。如果用户竞拍成功后竞购不买，未在拍卖竞购规则规定的时间内完成付款，将按照拍卖竞购规则直接扣除用户缴纳的保证金作为违约金用于赔付商家损失及拍卖人佣金费用。拍货郎在线拍卖平台无需就扣除的保证金向用户开具发票及收据等相关凭证；<br>
            4.6 以下两种情况下，将原路退还用户保证金：<br>
            4.6.1 用户未成功拍卖竞购商品；<br>
            4.6.2 用户拍卖竞购活动成功后，商家主动关闭交易或未履约发货。 <br>
            4.7 若拍卖竞购成功后，委托人具有成交不卖的违规行为，包括但不限于关闭交易或未履约发货，用户将获得由拍货郎在线拍卖平台提供的金额为所缴纳保证金金额一倍的赔偿金。
        </p>
        <h3 style="text-align:center;">第五条：平台服务及免责条款</h3>
        <p>
            5.1 本平台仅为在线拍卖服务平台，平台尽力向用户提供稳定的技术服务，使用户参与的拍卖竞购活动得以顺利进行；用户同意严格按照本协议约定及平台拍卖竞购规则使用技术服务。如用户行为违反本协议及平台拍卖竞购规则，本平台有权取消用户拍卖竞购资格，由此产生的损失及不利后果由用户自行承担。<br />
            5.2 本平台将在现有技术的基础上尽最大努力提供相应的安全措施以保障服务安全和正常运行。但由于可能存在的计算机病毒、网络通讯故障、浏览器兼容问题、系统维护等方面的因素以及可能发生的不可抗力事件，本平台在此明确声明对技术服务不作任何明示或暗示的保证，包括但不限于： 对服务的可适用性、没有错误或疏漏、持续性、准确性、可靠性、适用于某一特定用途。对此用户予以理解并不应要求本平台承担责任。<br />
            5.3 本平台仅向用户提供服务平台以便用户与拍卖委托人之间达成拍卖竞购活动相关的交易，本平台并非交易的参与方，不对委托人的任何口头、书面陈述或者向上传的线上信息及竞购活动商品的真实性、合法性做任何明示或暗示的担保，或对此承担任何责任。如因拍卖竞购活动商品交易产生纠纷的，包括但不限于因物流快递原因导致用户无法提取拍品的，均由委托人以自己的名义独立承担所有的法律责任。<br />
        </p>
        <h3 style="text-align:center;">第六条：协议生效及适用</h3>
        <p>6.1 用户通过本平台参与拍卖竞购活动即时本协议生效，本协议生效后即表示您选择接受本协议，并同意接受本协议的全部约定内容。<br />
            6.2 本协议内容包括协议正文、竞拍规则以及所有本平台已经发布的或将来可能发布的各类规则、操作流程。所有规则为协议不可分割的一部分，与协议正文具有同等的法律效力。本平台有权根据需要不时地制定、修改本协议、附件或各类规则、操作流程，如有任何变更，将在本平台上以公示形式通知用户。任何修订和新规则及流程一经公布即自动生效，成为本协议的一部分。如您继续在本平台参与拍卖竞购活动，则视为您对修改后的条款不持异议并同意遵守。
        </p>
        <h3 style="text-align:center;">第七条：法律适用与争议解决</h3>
        <p>7.1 本协议适用中华人民共和国法律。<br />
            7.2 因本协议产生的任何争议，由双方协商解决，协商不成的，任何一方有权提起仲裁。
        </p>
    </div>
    <span slot="footer" class="dialog-footer">
      <el-button type="primary" @click="submit">同意</el-button>
    </span>
  </el-dialog>
</template>
<script>
export default {
  data () {
    return {
      visible: false
    }
  },
  methods: {
    init () {
      this.visible = true
    },
    submit () {
      this.visible = false
      this.$emit('dialogHidden')
    }
  }
}
</script>
<style scoped>
.el-dialog__header{
  text-align: center;
}
.el-dialog{
  width: 90% !important;
}
h3{
  margin: 10px 0;
}
</style>
